{
    "ArticlesLength": 0,
    "AvailableTemplates": 0,
    "ContentVersionIds": [
        {
            "pdfContentVersionId": [
                "0688c000005WtJgAAK",
                "0688c000005XL04AAG",
                "0688c000005XLOzAAO"
            ]
        }
    ],
    "ContextId": "5008c00001IeZIzAAN",
    "CountTemplateSelected": 1,
    "FileFormat": "pdf",
    "Files": [
        {
            "pdfContentVersionId": [
                "0688c000005WtJgAAK",
                "0688c000005XL04AAG",
                "0688c000005XLOzAAO"
            ]
        }
    ],
    "FilesLength": 3,
    "FilesStatus": true,
    "LanguageCode": "en_US",
    "MIR_CoverLetterData": {
        "City": "San Francisco",
        "Date": "05-02-2022",
        "Description": "",
        "FirstName": "Lauren",
        "LastName": "Doyle",
        "Product": "Quattroglu",
        "State": "CA",
        "Street": "1 Market St",
        "UserEmail": "sivaji.kandimalla@salesforce.com",
        "UserFirstName": "Sivaji",
        "UserLastName": "Kandimalla",
        "UserPhone": "",
        "UserTitle": "",
        "Zip": "94105"
    },
    "MIR_CoverLetterDataStatus": true,
    "MedInfo-GetCaseFiles": {
        "ProductFiles": {
            "Id": "0688c000005WtJgAAK",
            "Name": "Quattroglu Product Insert",
            "TemplateType": "FILE",
            "VersionNumber": "1",
            "pdfContentVersionId": "0688c000005WtJgAAK"
        }
    },
    "MedInfo-GetCaseFilesStatus": true,
    "MedInfo-GetKnowledgeFiles": {
        "ArticleFiles": [
            {
                "Id": "0688c000005XL04AAG",
                "Name": "testing pdf",
                "TemplateType": "FILE",
                "VersionNumber": "1",
                "pdfContentVersionId": "0688c000005XL04AAG"
            },
            {
                "Id": "0688c000005XLOzAAO",
                "Name": "testing pdf2",
                "TemplateType": "FILE",
                "VersionNumber": "1",
                "pdfContentVersionId": "0688c000005XLOzAAO"
            }
        ],
        "Articles": [
            {
                "KnowledgeArticleID": "kA08c0000017D5yCAE",
                "Summary": "testing",
                "Title": "Frequently asked questions testing"
            },
            {
                "KnowledgeArticleID": "kA08c0000017CogCAE",
                "Title": "Knowledge Frequently asked questions about billing testing"
            },
            {
                "KnowledgeArticleID": "kA08c0000017CogCAE",
                "Title": "Knowledge Frequently asked questions about billing testing"
            },
            {
                "Detail": "<p><b>Q: How often should I replace my nasal pillows or cushion?</b><br>A: With regular care, nasal pillows and cushions should last 3 to 6 months but will vary by patient. The life of a mask cushion and pillow depends on use, the oils from your skin, and cleaning. It is always a good idea to inspect your mask routinely; poor care may adversely affect the fit of the cushion/pillow and thus performance.</p>\n\n<p>To get the longest life from your mask, be sure to wash your face each night before putting on your mask, and wash your mask after each use. Use only mild soap, nothing with perfumes, moisturizers, antibacterial agents, bleaches, etc, Always dry your mask and cushion out of direct sunlight.</p>\n\n<dl><dt id=\"4\"> </dt></dl>\n\n<p><b>Q: Where can I get reliable information on Sleep Apnea?</b><br>A:<a href=\"http://www.nhlbi.nih.gov/health/dci/Diseases/SleepApnea/SleepApnea_WhatIs.html\" target=\"_blank\">The National Institutes of Health</a>. The mission of this institue is to seek fundamental knowledge about the nature and behavior of living systems and the application of that knowledge to enhance health, lengthen life, and reduce the burdens of illness and disability. Additionally, we have some very informative and up to date information articles and blogs in the upper right hand corner of the Home Page.<br> </p>\n\n<p><b>Q: What is the difference between Resmed's sizes?</b>A: Shallow means that the top of the mask has a small cutout for the bridge of the nose. It generally is used for a less prominent nasal bridge. Standard, which is also the medium size, has a larger cutout to allow for a larger bridge.</p>\n\n<dl><dt id=\"6\"> </dt></dl>\n\n<p><b>Q: My CPAP machine is five years old. Should I get a new one?</b><br>A: Manufacturers create new and more effective CPAP models each year. There isn't any need to replace your CPAP unit because it is 5 years old but a malfunction could be dangerous. Has your unit been inspected yearly and are the pressure settings are accurate? Filters should be changed regularly. Ask the CPAP Shop what new features are available in order for you to continue using CPAP with greater comfort and convenience.</p>\n\n<dl><dt id=\"16\"> </dt></dl>\n\n<p><b>Q: Nasal Mask or Full Face Mask? Which one is better for me?</b>A: Using the right mask is essential to the success of your treatment. You will need a mask this is comfortable and fits properly. It should form a good seal on your face so that air doesn't leak as this would be uncomfortable and make your therapy less effective. A nasal mask which covers just the nose is the most common. However, some people breath through their mouth when they sleep. In this case, a full face mask that covers both the nose and mouth is the best option. Nasal pillows, 2 small oval shaped cushions that are inserted into the nose, are now becoming more popular. This type of Nasal mask offers a clear field of vision. Another option would be a nasal mask and chinstrap. This will prevent the jaw from opening during sleep and still provide for effective therapy.</p>\n\n<dl><dt id=\"7\"> </dt></dl>\n\n<p><b>Q: When I wake up in the morning I see strap marks on my face. Is that a problem?</b><br>A: If the marks resolve quickly after awakening, then it's not really an issue. If however, the marks progress toward pressure sores, then your mask is to tight. Remember, a tight fit is not necessarily a proper fit. A common error is to pull the headgear straps very tight. Newer masks are made of thinner, softer material which allows the mask to respond to body heat, thereby negating the need for pressure to ensure a leak free fit. Also, if you have persistent issues with masks, a zinc-oxide based adhesive tape on the sensitive areas may help alleviate the problem.</p>\n\n<dl><dt id=\"8\"> </dt></dl>\n\n<p><b>Q: I have OSA and I need to buy a bipap machine?</b><br>A: The first thing which needs to be done is to get a written prescription for the BiPap and its settings. Unless it is an Auto BiPAP, a IPAP and EPAP setting will be required. We suggest contacting us to determine different features and functionality for each BiPAP machine and mask. We can be reached via email at contact@thecpapshop.com or by phone at 866-414-9700.</p>\n\n<dl><dt id=\"9\"> </dt></dl>\n\n<p><b>Q: Last night was my first night wearing the CPAP mask. It was very uncomfortable. What can I do?</b><br>A: A common error is to secure the mask too tightly. While you are laying in bed, lay the mask on your face. Connect the headgear so the mask is snug but not tight. If you have a problem with leaking, the mask size could be the issue. There are many designs of masks, with different features intended to make the CPAP experience as comfortable and effective as possible. If the mask does not fit well, and is not comfortable, a person is less likely to be compliant. It is crucial to find a mask that is comfortable. We are always available to consult with you on different types and styles of masks.</p>\n\n<p><br><b>Q: I've had my CPAP machine 3 weeks and continue to sneeze all day. What may be causing this?</b><br>A: Perhaps your having an allergic reaction to the cleaner your using. If you are using humidity, try using distilled water. If neither of these help, perhaps your allegic to the material in CPAP mask. If the problem continues, please consult with us at contact@thecpapshop.com for further assistance.</p>\n\n<dl><dt id=\"10\"> </dt></dl>\n\n<p><b>Q: How much difference does it make on a CPAP machines setting to go from a 6 foot to an 8 foot hose?</b><br>A: It should not affect the pressure much but continue to monitor how you feel. If necessary, the machine will need to be adjusted slightly to suit your needs. We also have a handheld pressure meter which will allow you to measure the pressure at the end of the tube.</p>\n\n<dl><dt> </dt></dl>\n\n<p><b>Q: I have heard there are great new masks and headgear on the market. Should I try them out?</b><br>A: Only if you are having trouble with your current mask or headgear. Getting the proper fit is crucial in CPAP. A good fitting mask does not leak around the edges, does not leave pressure marks or cause pressure sores. Many of the newer CPAP masks available are made from softer, more pliable materials which provide a more comfortable fit with fewer leaks. Contact us at The CPAP Shop to understand the options available to you.</p>\n\n<p><br><b>Q: Will you bill my insurance company?</b></p>\n\n<p>A: To maintain our extremely low pricing, we do not deal directly with insurance companies. Nevertheless, we are listed by many insurance companies as an Out of Network provider. We cannot determine your particular level of reimbursement, if any. However, we are an Out of Network provider for Blue Cross/Blue Shield in PA. Our provider number is 1743518 which you can provide to any Blue Cross/Blue Shield in the US. We suggest you call your insurance company to get the paperwork and details on submitting a claim. We will work with you and provide you with the codes your insurance company requires. Please remember that this small amount of work will save you plenty of money in the long run.</p>\n\n<dl><dt> </dt></dl>\n\n<p><b>Q: How do you ship and what are your shipping costs?</b><br> A: Standard shipping is with USPS Priority Mail or UPS. Our standard shipping rate for within the continental U.S. is $7.75 for orders less than $100. For orders over $99, shipping is free. Overnight shipping is also available with in stock items. We also have standard rates for other parts of the world. If an international rate is not listed, please send us an email so we can determine the correct shipping rate.</p>\n\n<dl><dt id=\"17\"> </dt></dl>\n\n<p><b>Q: How do I know if I need a full face mask?</b></p>\n\n<p>A: Here is a checklist to determine if a full face mask is right for you.</p>\n\n<ul><li>\n\t<p>Do you often wake up with a dry mouth and/or throat?</p>\n\t</li><li>\n\t<p>Do you tend to breathe through your mouth rather than your nose?</p>\n\t</li><li>\n\t<p>Do you suffer from allergies?</p>\n\t</li><li>\n\t<p>Do you have a blocked nose or congestion at certain times of the year?</p>\n\t</li><li>\n\t<p>Have you ever had a broken nose?</p>\n\t</li><li>\n\t<p>Have you ever had nasal surgery?</p>\n\t</li><li>\n\t<p>Do you have a deviated septum(wall dividing nasal cavities leans towards one side)?</p>\n\t</li><li>\n\t<p>If you are already using therapy with a nasal mask: Are you continuing to snore even when using therapy?</p>\n\t</li><li>\n\t<p>Do you use a chinstrap?</p>\n\t</li></ul>",
                "KnowledgeArticleID": "kA08c0000016seSCAQ",
                "Summary": "Here are the frequently asked questions on how and when to use a CPAP",
                "Title": "CPAP FAQ"
            }
        ]
    },
    "MedInfo-GetKnowledgeFilesStatus": true,
    "ResponseAction1Status": true,
    "SObjectId": "5008c00001IeZIzAAN",
    "attachFileFormat": "pdf",
    "docGenerationMechanism": "VlocityClientSide",
    "docTitle": "",
    "documentTitle": "",
    "documentViewer": "VlocityClientSideViewer",
    "downloadFileFormat": "all",
    "generateDocument": {
        "GenerateDocumentWord": [
            {
                "FetchDocumentTemplateFromNameStatus": true,
                "Id": "aE18c000000SHiTCAW",
                "LoopBlockIterationIndex": 1,
                "LoopBlockIterationStatus": true,
                "Name": "MedInfoCoverLetter",
                "TemplateType": "Microsoft Word .DOCX Template",
                "VersionNumber": 4,
                "distributionPublicUrl": "",
                "documentTitle": "Makana MIR.docx",
                "initiatePDFGeneration": true,
                "pdfContentVersionId": "0688c000005XLSiAAO",
                "pdfDocumentTitle": "",
                "wordContentVersionId": "0688c000005XLShAAO"
            }
        ]
    },
    "generateMergeDocument": {
    },
    "generatePdfDocument": true,
    "options": {
        "chainable": false,
        "ignoreCache": false,
        "postTransformBundle": "",
        "preTransformBundle": "",
        "useContinuation": false,
        "useFuture": false,
        "useQueueableApexRemoting": false,
        "vlcClass": "omnistudio.IntegrationProcedureService"
    },
    "pdfContentVersionIds": [
        "0688c000005XLSiAAO",
        "(0688c000005WtJgAAK, 0688c000005XL04AAG, 0688c000005XLOzAAO)"
    ],
    "pdfGenerationCompleted": true,
    "pdfGenerationSource": "VlocityClientSide",
    "response": {
    },
    "selectedTemplate": [
        {
            "FetchDocumentTemplateFromNameStatus": true,
            "Id": "aE18c000000SHiTCAW",
            "LoopBlockIterationIndex": 1,
            "LoopBlockIterationStatus": true,
            "Name": "MedInfoCoverLetter",
            "TemplateType": "Microsoft Word .DOCX Template",
            "VersionNumber": 4
        }
    ],
    "templateNames": [
        {
            "VlocityDocumentTemplate": "MedInfoCoverLetter"
        }
    ],
    "templateType": "Microsoft Word .DOCX Template",
    "timeStamp": "2022-05-02T14:18:18.177Z",
    "useTemplateDRExtract": "No",
    "userCurrencyCode": "USD",
    "userId": "0058c00000BHQVoAAP",
    "userName": "sivajikandimalla@sivajikandimalla-220330-790.demo",
    "userProfile": "System Administrator",
    "userTimeZone": "-420",
    "userTimeZoneName": "America/Los_Angeles"
}